Autodesk.Navisworks.Api.PropertyCategoryNames
Names (values of Autodesk.Navisworks.Api.PropertyCategory.Name) of commonly found property categories.

Autodesk.Navisworks.Api.PropertyCategoryNames.AutoCad
Name of AutoCAD "AutoCad" property category

Autodesk.Navisworks.Api.PropertyCategoryNames.AutoCadEntityHandle
Name of AutoCAD "Entity Handle" property category

Autodesk.Navisworks.Api.PropertyCategoryNames.Geometry
Name of "Geometry" property category

Autodesk.Navisworks.Api.PropertyCategoryNames.Hyperlinks
Name of "Hyperlinks" property category

Autodesk.Navisworks.Api.PropertyCategoryNames.Item
Name of "Item" property category

Autodesk.Navisworks.Api.PropertyCategoryNames.Material
Name of "Material" property category

Autodesk.Navisworks.Api.PropertyCategoryNames.Microstation
Name of Microstation "MicroStation" property category

Autodesk.Navisworks.Api.PropertyCategoryNames.MicrostationElementId
Name of Microstation "Element Id" property category

Autodesk.Navisworks.Api.PropertyCategoryNames.RevitElementId
Name of Revit "Element Id" property category

Autodesk.Navisworks.Api.PropertyCategoryNames.Transform
Name of "Transform" property category

Autodesk.Navisworks.Api.PropertyCategoryNames.XRef
Name of "XRef" property category